{
  "metadata": {
    "author": "David Hume",
    "entry_count": 50,
    "style": "academic_paraphrase_structured",
    "generated_utc": "2026-02-12T14:12:08.266217"
  },
  "entries": [
    {
      "text": "Hume argues that Causation arises from habitual expectation rather than necessary linkage.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that The self is a bundle of perceptions.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that Induction lacks rational proof.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that Belief emerges from custom.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that Reason is subordinate to passion.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that Moral judgment stems from sentiment.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that Relations of ideas differ from matters of fact.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that Skepticism tempers metaphysical certainty.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that Miracles violate uniform experience.",
      "field": "epistemology"
    },
    {
      "text": "Hume argues that Custom structures cognition.",
      "field": "epistemology"
    },
    {
      "text": "In his political essays, Hume suggests that balanced government prevents factional dominance.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that authority depends on opinion rather than force.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that constitutional monarchy stabilizes liberty.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that convention grounds political legitimacy.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that gradual reform surpasses revolution.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that commercial society fosters civility.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that faction is natural to plural interests.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that institutional continuity preserves liberty.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that political stability moderates extremism.",
      "field": "political theory"
    },
    {
      "text": "In his political essays, Hume suggests that historical development shapes governance.",
      "field": "political theory"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that true judges possess delicacy of taste.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that standards of taste arise from cultivated comparison.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that beauty depends on sentiment yet admits refinement.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that art refines emotion.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that criticism requires experience and practice.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that taste matures through exposure.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that aesthetic judgment blends subjectivity and consensus.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that imagination shapes artistic appreciation.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that refinement parallels moral development.",
      "field": "aesthetics"
    },
    {
      "text": "In his aesthetic theory, Hume maintains that shared faculties ground aesthetic evaluation.",
      "field": "aesthetics"
    },
    {
      "text": "In his historical writings, Hume observes that historical narrative must balance impartiality with interpretation.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that civil conflict shapes constitutional development.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that religious enthusiasm destabilizes political order.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that monarchical excess invites resistance.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that historical causation reflects human passions.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that commerce influences constitutional change.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that religious reform reconfigures national identity.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that customary institutions outlast abstract theory.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that historical prudence requires contextual judgment.",
      "field": "history"
    },
    {
      "text": "In his historical writings, Hume observes that political moderation emerges through experience.",
      "field": "history"
    },
    {
      "text": "In his economic essays, Hume contends that commerce promotes peaceful international relations.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that money supply influences price stability.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that luxury can stimulate economic vitality.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that trade encourages mutual dependence.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that economic growth supports political moderation.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that specie flow regulates international markets.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that manufacturing increases national wealth.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that credit systems require public confidence.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that economic interdependence tempers warfare.",
      "field": "economic thought"
    },
    {
      "text": "In his economic essays, Hume contends that industry enhances civil refinement.",
      "field": "economic thought"
    }
  ]
}
